In [1]:
import pandas as pd
import numpy as np
import re
import unicodedata
import pickle

from _html_parser import ParsingDataPrepare

pd.set_option('display.max_colwidth', 1000)
pd.set_option('display.max_rows', 2000)

In [2]:
%load_ext autoreload

In [3]:
from  geopy.geocoders import Nominatim
geolocator = Nominatim(user_agent="Your_Name")

city ="Agra"
country ="India"
loc = geolocator.geocode(city+','+ country)
lat = loc.latitude
long = loc.longitude

print(lat, long)

27.1752554 78.0098161

In [4]:
df_country_code = pd.read_csv('csv_files/wikipedia-iso-country-codes.csv')

In [5]:
df_country_code.columns = [x.lower() for x in df_country_code.columns]
df_country_code['alpha-2 code'] = df_country_code['alpha-2 code'].map(lambda x: str(x).lower())
df_country_code.shape

(246, 5)

In [6]:
df_country_code.head(3)

,english short name lower case,alpha-2 code,alpha-3 code,numeric code,iso 3166-2
0,Afghanistan,af,AFG,4,ISO 3166-2:AF
1,Åland Islands,ax,ALA,248,ISO 3166-2:AX
2,Albania,al,ALB,8,ISO 3166-2:AL

In [7]:
df_country_code.tail(3)

,english short name lower case,alpha-2 code,alpha-3 code,numeric code,iso 3166-2
243,Yemen,ye,YEM,887,ISO 3166-2:YE
244,Zambia,zm,ZMB,894,ISO 3166-2:ZM
245,Zimbabwe,zw,ZWE,716,ISO 3166-2:ZW

In [8]:
df_world_cities_head = pd.read_csv('csv_files/head_worldcitiespop.csv', dtype='str') 
df_world_cities_tail = pd.read_csv('csv_files/tail_worldcitiespop.csv', dtype='str')

df_world_cities = pd.concat([df_world_cities_head, df_world_cities_tail], axis=0)
df_world_cities.columns = [x.lower() for x in df_world_cities.columns]

In [9]:
df_world_cities.shape

(3173958, 7)

In [10]:
df_world_cities.drop_duplicates(subset=['country', 'city'], inplace=True)
df_world_cities.shape

(2611448, 7)

In [11]:
df_world_cities.head(3)

,country,city,accentcity,region,population,latitude,longitude
0,ad,aixas,Aixàs,06,NaN,42.4833333,1.4666667
1,ad,aixirivali,Aixirivali,06,NaN,42.466666700000005,1.5
2,ad,aixirivall,Aixirivall,06,NaN,42.466666700000005,1.5

In [12]:
df_world_cities.tail(3)

,country,city,accentcity,region,population,latitude,longitude
1673956,zw,zizalisari,Zizalisari,04,NaN,-17.7588889,31.010555600000004
1673957,zw,zuzumba,Zuzumba,06,NaN,-20.033333300000002,27.933333299999997
1673958,zw,zvishavane,Zvishavane,07,79876.0,-20.3333333,30.0333333

In [13]:
df_world_cities = df_world_cities.merge(df_country_code[['alpha-2 code', 'english short name lower case']],
                                         how='left', left_on='country', right_on='alpha-2 code')

In [14]:
df_world_cities.drop(columns=['country', 'city', 'region', 'alpha-2 code'], inplace=True)

In [15]:
df_world_cities.columns = ['city', 'population','latitude', 'longitude', 'country']

In [16]:
df_world_cities.shape

(2611448, 5)

In [17]:
df_world_cities = df_world_cities[df_world_cities['country'].notna()]
df_world_cities = df_world_cities[df_world_cities['city'].notna()]

In [18]:
df_world_cities = df_world_cities[['country', 'city', 'population', 'latitude', 'longitude']]

In [19]:
df_world_cities

,country,city,population,latitude,longitude
0,Andorra,Aixàs,NaN,42.4833333,1.4666667
1,Andorra,Aixirivali,NaN,42.466666700000005,1.5
2,Andorra,Aixirivall,NaN,42.466666700000005,1.5
3,Andorra,Aixirvall,NaN,42.466666700000005,1.5
4,Andorra,Aixovall,NaN,42.466666700000005,1.4833333
...,...,...,...,...,...
2611443,Zimbabwe,Zimre Park,NaN,-17.8661111,31.213611100000005
2611444,Zimbabwe,Ziyakamanas,NaN,-18.216666699999998,27.95
2611445,Zimbabwe,Zizalisari,NaN,-17.7588889,31.010555600000004
2611446,Zimbabwe,Zuzumba,NaN,-20.033333300000002,27.933333299999997
2611447,Zimbabwe,Zvishavane,79876.0,-20.3333333,30.0333333

### Lat_lon

In [20]:
# palmyra = LatLon(Latitude(42.4833333), Longitude(1.4666667)) # Location of Palmyra Atoll in decimal degrees
# palmyra = LatLon(5.8833, -162.0833) # Same thing but simpler!
# palmyra = LatLon(Latitude(degree = 5, minute = 52, second = 59.88), Longitude(degree = -162, minute = -4.998) # or more complicated!
# cordinates = palmyra.to_string('d% %m% %S% %H') # Print coordinates to degree minute second
# ('5 52 59.88 N', '162 4 59.88 W')

In [21]:
df = df_world_cities[['latitude', 'longitude']].copy()

In [22]:
df_world_cities['lat'], df_world_cities['lon'] = ParsingDataPrepare.lat_lon_calculate(df_world_cities)

In [23]:
df_world_cities

          country         city population   latitude  longitude    lat    lon
0         Andorra        Aixàs        NaN  42.483333   1.466667  42n28   1e28
1         Andorra   Aixirivali        NaN  42.466667   1.500000  42n28   1e30
2         Andorra   Aixirivall        NaN  42.466667   1.500000  42n28   1e30
3         Andorra    Aixirvall        NaN  42.466667   1.500000  42n28   1e30
4         Andorra     Aixovall        NaN  42.466667   1.483333  42n28   1e28
...           ...          ...        ...        ...        ...    ...    ...
2589178  Zimbabwe   Zimre Park        NaN -17.866111  31.213611  17s51  31e12
2589179  Zimbabwe  Ziyakamanas        NaN -18.216667  27.950000  18s13  27e56
2589180  Zimbabwe   Zizalisari        NaN -17.758889  31.010556  17s45   31e0
2589181  Zimbabwe      Zuzumba        NaN -20.033333  27.933333   20s1  27e55
2589182  Zimbabwe   Zvishavane    79876.0 -20.333333  30.033333  20s19   30e1

[2589183 rows x 7 columns]

#### Devide df_world_cities on two files because it size wery big for git

In [34]:
df_world_cities_1 = df_world_cities.loc[:1200000,]
df_world_cities_2 = df_world_cities.loc[1200001:,]

In [41]:
# world_cities = open('pickle_files/df_world_cities_2', 'wb')
# pickle.dump(df_world_cities_2, world_cities)  
# world_cities.close()

In [42]:
# with open('pickle_files/df_world_cities_1', 'rb') as f:
#     world_cities = pickle.load(f)

In [40]:
# world_cities